import jieba
from pyspark import SparkConf,SparkContext
from pyspark.storagelevel import StorageLevel
# distinct算子实现去重操作
if __name__ == '__main__':
    #repartition 重新分区
    conf =SparkConf().setAppName("test").setMaster("local[*]")
    sc = SparkContext(conf=conf)
    file = sc.textFile("./data/SogouQ_mini.txt")
    #对数据按照'\t'进行切分
    split_rdd = file.map(lambda x:x.split("\t"))
    split_rdd.persist(StorageLevel.DISK_ONLY) #有多个任务
    #1.用户搜索的关键词
    # print(split_rdd.takeSample(True,3))
    """[['00:00:00', '8242389147671512', '[捷克民歌土风舞++教案]', '2', '3', 'shwamlys.blog.sohu.com/76558184.html'],
     ['00:00:04', '07594220010824798', '[哄抢救灾物资]', '3', '2', 'www.17tech.com/news/20080531107270.shtml'], 
     ['00:00:03', '03151010454922942', '[Norajo-Day+It+Take(Remix)]', '14', '31', 'ting.666ccc.com/song_words/89845.html']]

    """
    content_text = split_rdd.map(lambda x:x[2]) #拿到其中文本的内容的嵌套列表
    def process(data):
        alist = jieba.cut_for_search(data)
        l=[]
        for a in alist:
            l.append(a)
        return l

    words_rdd = content_text.flatMap(process) #拿到所有的词
    #print(words_rdd.collect())
    """
    '[', '360', '安全', '卫士', '安全卫士', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', '75810', '部队', ']', '[', '绳艺', ']', '[', '汶川', '地震', '原因', ']', '[', '莫衷一是', '的', '意思', ']', '[', '星梦', '星梦缘', '全集', '在线', '观看', ']', '[', '闪字', '吧', ']', '[', '霍震霆', '与', '玲玲', '朱玲玲', '照片', ']', '[', '电脑', '创业', ']', '[', '111aa', '图片', ']', '[', '豆腐', '的', '制成', ']', '[', 'tudou', '.', 'com', '+', '禁播', '电影', ']', '[', '最佳', '受孕', '时间', ']', '[', '捷克', '民歌', '土风', '土风舞', '++', '教案', ']', '[', 'pdf', ']', '[', '喷', '嘭', '乐团', 'lonely', '+', 'day', ']', '[', '尼康', '相机', '报价', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', '1000', ']', '[', '剑荡', '天下', '+++', '展鹏', ']', '[', '人妖', ']', '[', '印尼', '排华', '是', '怎么', '回事', '怎么回事', ']', '[', '东莞', '东莞市', '塘', '厦新', '泰', '塑胶', '五金', '塑胶五金', '厂', ']', '[', '胡其美', ']', '[', '女士', '找', '鸭子', '经历', ']', '[', '2008', '年', '运程', ']', '[', '芭蕾', '舞剧', '芭蕾舞', '芭蕾舞剧', '《', '天鹅', '鹅湖', '天鹅湖', '》', ']', '[', '不锈', '不锈钢', ']', '[', '明星', '合成', ']', '[', '骆冰', '下载', ']', '[', '欧洲', '冠军', '联赛', '冠军联赛', '决赛', ']', '[', '不锈', '不锈钢', ']', '[', '18', '+', 'girl', '+', 'japan', ']', '[', '年轻', '年轻人', '住房', '问题', '住房问题', ']', '[', '黑帮', '千金', '要', '结婚', ']', '[', 'MD', '游戏', '下载', ']', '[', '印尼', '排华', '是', '怎么', '回事', '怎么回事', ']', '[', '测出', '四川', '汶川', '地震', ']', '[', '彩信', '相册', ']', '[', '免费', '看', '三级', '图片', ']', '[', 'link', ':', 'jejie', '.', 'cn', ']', '[', 'sj', '+', 'c', '中文', '首站', ']', '[', '女犯', '鞭刑', ']', '[', 'scat', ']', '[', '健美', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', 'www.5252', 'se', '.', 'com', ']', '[', '对', '坚持', '科学', '发展', '发展观', '、', '构建', '和谐', '社会', '和谐社会', '的', '认识', ']', '[', '蒙古', '古国', '蒙古国', '地图', ']', '[', '英语', '培训', ']', '[', '房价', '什么', '时间', '下调', ']', '[', '党宁', '的', '博客', ']', '[', '窗外', ']', '[', '2008', '年', '新兴', '行业', ']', '[', '耐克', '凉鞋', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', 'fucking', ']', '[', '免费', '取名', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', '欧美', '金发', '女郎', '金发女郎', ']', '[', 'google', ']', '[', '欧美', '+', '模特', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', '芜湖', '旅游', ']', '[', '奥运', ']', '[', '夏季', '服装', '如何', '搭配', ']', '[', '中文', '小说', '+', '武林', '萌主', ']', '[', 'xingjiao', '姿势', '图片', ']', '[', '化妆', '培训', '培训班', ']', '[', 'Norajo', '-', 'Day', '+', 'It', '+', 'Take', '(', 'Remix', ')', ']', '[', '绝世', '风尚', ']', '[', '莎', '朗斯', '通', '电影', ']', '[', '36XP', ']', '[', '韩国', '劲', '爆', '舞曲', ']', '[', '大鹏', ']', '[', '始皇', '秦始皇', '陵墓', ']', '[', '金鳞', 'MP3', ']', '[', '青海', '青海湖', '水怪', ']', '[', '电脑', '创业', ']', '[', '司莫司', '汀', ']', '[', '天涯', '社区', '天涯社区', '+', '娱乐', '八卦', ']', '[', '哄抢', '救灾', '物资', '救灾物资', ']', '[', '北京', '欢迎', '你', 'mp4', '格式', ']', '[', 'big', '+', 'breast', ']']
"""
    result = words_rdd.reduceByKey(lambda a,b:a+b).\
        sortBy(lambda x:x[1],ascending=False,numPartitions=1)
    print('1',result)

